Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: པདྨའི་ཕྲེང་བ་ཚོན་གྱིས་མཛེས་པ་བྲིས་ལ།
en: Around this he should draw a garland of lotuses, using paints with bright and vivid colors. “

source: དེའི་དབུས་སུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཐུབ་པ་ཆེན་པོ་ཤཱཀྱའི་རྒྱལ་པོ་དང་།
en: In the center of the maṇḍala, the vidyā holder should place the blessed Buddha, the great sage of the royal Śākya line, as well as Amitābha and the Tathāgata Lokendrarāja.

source: འོད་དཔག་མེད་དང་། འཇིག་རྟེན་དབང་པོའི་རྒྱལ་པོ་གཞག་གོ། །གཡས་སུ་མགོན་པོ་འཇིག་རྟེན་དབང་ཕྱུག་དོན་ཡོད་པའི་ཞགས་པའི་ཆ་བྱད་འཆང་བ་གསང་སྔགས་ཀྱི་རྗེས་སུ་འབྲང་བར་བྱའོ།
en: To the right is the lord and protector, the Lokeśvara in the garb of Amoghapāśa that conforms with the mantra tradition.

source: །གཡོན་དུ་ཕྱག་ན་རྡོ་རྗེ་རྔ་ཡབ་དང་།
en: To the left is Vajrapāṇi holding a yak-tail whisk and a vajra.

source: རྡོ་རྗེ་ཐོགས་པ་བཞིན་ཁྲོ་གཉེར་ཅན་འོད་འབར་བས་བསྐོར་བའོ།
en: His eyebrows are knitted and he stands within a halo of flames.

source: །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་དྲུང་དུ་ལྷ་མོ་སྒྲོལ་མ་དང་། དྲི་མེད་འོད་འཕྲོ་བྱའོ།
en: Next to Noble Avalokiteśvara are the goddesses Tārā and Vimalamati.

source: །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་འོག་ཏུ་དཀར་ཤ་མ་ཆེན་མོ་དང་། གོས་དཀར་མོ་དང་། དཀར་མོ་ཆེན་མོ་ལག་ན་དབྱུག་པ་དང་།
en: Beneath Noble Avalokiteśvara are Mahāgaurī, Pāṇḍaravāsinī, and Mahāśvetā, each holding a staff and a water pitcher in their hands.

source: རིལ་བ་སྤྱི་བླུགས་ཐོགས་པའོ། །དེའི་འོག་ཏུ་སྲིན་མོ་རལ་པ་གཅིག་པ་མཆེ་བ་གཙིགས་པ་ཐོད་པའི་ཕྲེང་བ་ཐོགས་པ།
en: Beneath them, the vidyā holder should draw the rākṣasī Ekajaṭā with a face contorted in anger, with protruding fangs, and wearing garland of human skulls and a snake for a sacred thread.

source: སྦྲུལ་གྱི་མཆོད་ཕྱིར་ཐོགས་པ་ལག་པ་བཞི་པ། ལག་པ་གཡས་གཡོན་གཉིས་ན་རྡོ་རྗེ་དང་། དགྲ་སྟ་དང་། གཡས་པའི་གུང་མོ་ལྷ་དང་།
en: She has four arms: the upper right holds a vajra, the upper left an axe, and she threatens the asuras and vināyakas with her left forefinger. “

source: ལོག་འདྲེན་ལ་བསྡིགས་པར་བྱའོ། །གཡོན་དུ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་བྲམ་ཟེའི་ཆ་ལུགས་འཆང་བ་རལ་པའི་ཐོར་ཚུགས་ཀྱིས་བཞུགས་པ། འོད་དཔག་མེད་ཀྱི་ཐོར་ཚུགས་ཀྱིས་བརྒྱན་པར་བྱའོ།
en: To the left of the Tathāgata Śākyamuni is Noble Avalokiteśvara, dressed in the garb of Brahmā and adorned with a diadem atop his topknot.

source: །གཡས་གཡོན་དུ་དབང་ཕྱུག་དང་། དབང་ཕྱུག་ཆེན་པོ་བྱའོ། །དེའི་འོག་ཏུ་དཔལ་ལྷ་མོ་དང་།
en: To his left and right are, respectively, Īśvara and Maheśvara.

source: ལྷ་མོ་དབྱངས་ཅན་མ་དང་། མཚན་མོའི་ལྷ་མོ་དང་། སའི་ལྷ་མོ་དང་། ལོ་ཐོག་གི་ལྷ་མོ་དང་། འབྲས་བུ་དང་མེ་ཏོག་གི་ལྷ་མོ་བྱའོ།
en: Below Noble Avalokiteśvara, the vidyā holder should draw the goddesses Śrī and Sarasvatī, the deities of the night, the deities of crops, and the deities of fruits and flowers.

source: །དེའི་འོག་ཏུ་ཁོར་ཡུག་ཏུ་གཤིན་རྗེ་དང་། ཆུ་ལྷ་དང་། རླུང་ལྷ་ལ་སོགས་པ་བྱའོ།
en: Beneath them, in a circle, he should draw Yama, Varuṇa, Kubera, and so forth.

source: །རལ་པའི་ཐོར་ཚུགས་ཀྱིས་བརྒྱན་པའི་དྲང་སྲོང་གཞག་པར་བྱའོ།
en: He should also add the ṛṣis adorned with diadems in their topknots.

source: །གྲྭར་རྒྱལ་པོ་ཆེན་པོ་བཞི་གོ་ཆ་བགོས་པ་གཞག་པར་བྱའོ།
en: In the four corners he should draw the Four Great Kings wearing their cuirasses and coats of mail.

source: །དཀྱིལ་འཁོར་གྱི་སྙིང་པོའི་དབུས་དང་བར་བར་དུ་ལྕགས་ཀྱུ་དང་། དགྲ་སྟ་དང་། རྡོ་རྗེ་དང་། དབྱུག་བ་དང་། ཞགས་པ་དང་།
en: In the spaces in between, on the inside, there should be a goad, an axe, a vajra, a staff, a noose, and a chain. “

source: ལྕགས་སྒྲོག་བྱའོ། །ཕྱི་རོལ་དུ་ཚངས་པ་དང་། དྲག་པོ་དང་། ལྷ་མོ་ཨུ་མ་དང་། ཚངས་པའི་དྲུང་དུ་ལྷ་མོ་དབྱངས་ལྡན་མ་ཁྲོས་པའི་གཟུགས་ཅན་ནོ།
en: Outside the maṇḍala are Brahmā, Rudra, and the goddess Umā.

source: །དེ་གཉིས་ཀྱི་བར་དུ་དབྱུག་པ་དང་། རིལ་བ་སྤྱི་བླུགས་བྲི་བར་བྱའོ།
en: Brahmā is flanked by Sarasvatī, who is knitting her eyebrows, and there is a staff and a water pitcher between them.

source: །གྲྭ་གཅིག་ཏུ་དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོའི་རྣམ་པར་གྲོལ་བའི་དཀྱིལ་འཁོར་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་གཞག་གོ།
en: In one corner, the vidyā holder should draw a volume of this Dharma treatise, the maṇḍala of liberation that constitutes the heart essence of Amoghapāśa.

source: །གྲྭ་གཅིག་ཏུ་ཤི་བཱ་བ་ཧ་གཞག་གོ།
en: In another corner he should draw Śiva’s mount.

source: །དེ་ནས་ཤར་ཕྱོགས་ཀྱི་སྒོར་ཁྲོ་བོ་རྟ་མགྲིན་འཇིགས་སུ་རུང་བའི་མིག་ཅན་གཞག་གོ།
en: In the eastern door is the wrathful Hayagrīva with terrifying eyes.

source: །ལྷོ་ཕྱོགས་ཀྱི་སྒོར་རྡོ་རྗེ་ཆེན་པོ་ཀི་ལི་ཀི་ལ་ཞེས་བྱ་བ། རྡོ་རྗེ་རྣམ་པར་འདྲེན་པ། ལག་ན་རྡོ་རྗེ་དང་། དགྲ་སྟ་དང་། ཞགས་པ་ཐོགས་པར་བྱའོ།
en: In the southern door is a great vajravināyaka named Kelikila who holds a vajra, axe, and noose.

source: །ནུབ་ཕྱོགས་ཀྱི་སྒོར་ཕོ་ཉ་མོ་པདྨའི་རིགས་མཛེས་མ་ལག་པ་པདྨའི་རྩེ་མོ་ནས་འཛིན་པར་བྱའོ།
en: In the western door is a dūtī named Padma­kula­sundarī with her hands extended.

source: །བྱང་ཕྱོགས་ཀྱི་སྒོར་རྡོ་རྗེ་ཆེན་པོ་ཟོམ་ཞེས་བྱ་བའི་ཚོགས་ལག་ན་རྡོ་རྗེ་དང་ཞགས་པ་ཐོགས་པ་བྱའོ།
en: In the northern door is a gaṇa named Mahā­vajra­śikhara holding a vajra and a noose. “Then, the vidyā holder should place at the entrance door a jar filled with perfumed water and tied with silk.

source: །དེ་ནས་འཇུག་པའི་སྒོ་ནས་གསེར་གྱི་བུམ་པ་སྤོས་ཆུས་བཀང་སྟེ་དར་ལས་བཅིངས་ལ་རྣམ་པ་ཐམས་ཅད་དང་། མེ་ཏོག་གི་ཕྲེང་བས་བརྒྱན་ནས་བསམ་པ་ཅི་ལྟ་བ་བཞིན་དུ་དཀྱིལ་འཁོར་གྱི་དབུས་སུ་བཞག་སྟེ། སྟེང་དུ་སྣ་མའི་མེ་ཏོག་གི་གདུ་བུ་གཞག་པར་བྱའོ། །ཙནྡན་དང་།
en: In the center of the maṇḍala, he should place a jar of his liking with a golden cover and filled with water that has been suffused with sandalwood, saffron, musk, and camphor. He should adorn this jar with all the ornaments, cover it with a fine ‘Chinese cloth,’ adorn it with garlands of flowers, and place on top of it a golden ring.

source: གུར་གུམ་དང་། གླ་རྩི་དང་། ག་བུར་གྱི་ཆུ་དང་། པོག་ཕོར་བཞི་གཞག་ཅིང་།
en: Around it he should place four incense burners and burn incense of agarwood. “

source: ཨ་ག་རུའི་བདུག་པས་བདུག་གོ། །ཚོན་སྣ་ལྔའི་རས་ཀྱི་སྲད་བུ་མཆོད་ཕྱིར་གྱི་སྲད་བུ་ཚད་དུ་བྱས་ལ། གསེར་གྱི་ཡང་མིག་རྩེ་གསུམ་ཅན་གདགས་པར་བྱ་ཞིང་།
en: He should then prepare a thread of five-colored silk the same length as a sacred thread and attach it to a golden trident and ring.

source: ཐོར་ཏོ་གཅིག་ཏུ་མེ་ཏོག་པདྨའི་གདུབ་ཀོར་དང་མུ་ཏིག་དང་རིན་པོ་ཆེས་སྤྲས་པ།
en: To its other end, he should tie a ‘lotus pot’ inlaid with jewels and pearls.

source: ཟླུམ་པོར་བསྐྱིལ་ལ་བུམ་པའི་སྟེང་དུ་བཞག་ལ་མཆོད་པ་དང་།
en: He should then place the coiled thread on top of the jar and make offerings and acts of reverence to it.

source: བསྙེན་བཀུར་བྱས་ཏེ་ཡུངས་ཀར་ལ་དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་ལན་སྟོང་རྩ་བརྒྱད་བཟླས་ཏེ། དེ་ལ་གདབ་པར་བྱའོ།
en: Incanting mustard seeds one thousand and eight times with the heart mantra of Amoghapāśa, he should scatter them on the thread.

source: །ཙནྡན་དང་། ག་བུར་དང་། གླ་རྩིའི་ཕྱེ་མས་བསྒོས་ལ་བསྒོ་བར་བྱའོ།
en: He should perfume the site with sandalwood, camphor, musk, or scented powders. “

source: སྒོ་བཞིའི་གནས་སུ་དྲི་ཆབ་ཀྱིས་བཀང་བའི་བུམ་པ་དང་། ཟས་དཀར་གསུམ་གྱི་གཏོར་མ་གཞག་པར་བྱ་ཞིང་གསེར་དངུལ་གྱི་མཆོད་ཡོན་གྱི་སྣོད་སུམ་ཅུ་རྩ་གཉིས་དང་། སྤོས་ཆུས་བཀང་བ་བརྒྱད་དང་། སྤོས་ཆུ་དཀར་པོས་བཀང་བ་བརྒྱད་གཞག་པར་བྱའོ། །རོ་དང་དྲི་སྣ་ཚོགས་ཀྱིས་བཀང་བ་བརྒྱད་དང་། ཞོ་དང་།
en: He should then place vessels filled with perfumed water and the three ‘white’ foods at the four doors.

source: འོ་མ་དང་། སྤོས་ཆུས་བཀང་བ་བརྒྱད་དང་། གཏོར་མ་ལ་སོགས་པ་དབུལ་བ་སྣ་བརྒྱད་དང་། དབུལ་བ་སྣ་དྲུག་ཅུ་རྩ་བཞི་བ་རྣམས་ཤ་དང་། ཁྲག་དང་། ཀུན་དོང་དང་། ཀེའུ་དང་། ཁ་ཟས་ངན་པ་དང་། བཏུང་བ་ངན་པ་སྤངས་ཏེ།
en: These should include thirty-two vessels filled with argha water, and also golden or silver vessels, eight of which should be filled with perfumed water, eight with white scented water, eight with foods of various flavors and aromas, eight with scented curds and milk, and eight with sixty-four bali articles free of any meat, blood, onions, garlic, food that has spoiled, or wilted flowers.

source: གཙང་མས་གཙང་མ་སྦྱར་བར་བྱའོ།
en: The offerings should be prepared by a pure vidyā holder using pure ingredients.

source: །མེ་ཏོག་སྣ་ཚོགས་ཀྱི་གཅལ་དགྲམ་པར་བྱ་ཞིང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། ལྡ་ལྡི་དང་། བ་དན་གྱིས་བརྒྱན་པར་བྱ།
en: The maṇḍala should be carpeted with various flowers and adorned with a variety of parasols, banners, draperies, and flags.

source: པོག་ཕོར་སུམ་ཅུ་རྩ་གཉིས་གཞག་པར་བྱ་ཞིང་། བདུག་སྤོས་སྣ་ཚོགས་མང་པོས་བདུག་པར་བྱ།
en: Thirty-two incense burners should be placed around it, and a variety of fine incenses should be burned.

source: སྤོས་སྣ་བརྒྱ་རྩ་བརྒྱད་དང་ལྡན་པའི་ཏིལ་མར་གྱི་མར་མེ་བལྟམ་པར་བྱ། དཀྱིལ་འཁོར་གྱི་ཁོར་ཡུག་ཏུ་པདྨའི་ཕྲེང་བ་བྲི་བར་བྱའོ།
en: The vidyā holder should light one hundred and eight lamps with scented oil and draw a lotus garland around the maṇḍala. “

source: །རིག་སྔགས་འཆང་གཙང་མས་གོས་གཙང་མ་བགོ་བར་བྱ་ཞིང་། དུས་གསུམ་དུ་ཁྲུས་བྱས་ལ་གོས་གསུམ་བགོ་བར་བྱ།
en: The vidyā holder should be ritually pure, wear clean clothes, bathe three times a day, and wear a three-piece garment.

source: གྲོགས་གཙང་མ་བསྒྲུབ་པར་བྱའོ།
en: While performing the rite of entering the maṇḍala, he should surround himself with assistants who are ritually pure.

source: །འཇུག་པའི་ཆོ་ག་བྱས་པ་ནས་དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོས་དབང་བསྐུར་བའི་བར་ཙམ་གྱིས་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་ཡོངས་སུ་གཟུང་ཞིང་། འཇིག་རྟེན་མགོན་པོས་བྱིན་གྱིས་བརླབས་པ་དང་།
en: As soon as he has consecrated himself by means of the heart mantra of Amoghapāśa, he will be accepted by all the buddhas and blessed by the Lord of the World.

source: པདྨའི་རིགས་པདྨ་འཆང་བའི་དཀྱིལ་འཁོར་ཆེན་པོ་དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོའི་དངོས་གྲུབ་ལ་མངོན་དུ་ཕྱོགས་པར་འགྱུར་རོ། །གང་བསམས་པ་ཐམས་ཅད་དེ་ཁོ་ན་བཞིན་བྱེད་པར་འགྱུར་རོ། །དམ་ཚིག་ཐམས་ཅད་ལ་དོན་ཡོད་པར་འཇུག་གོ།
en: He will accomplish the heart of Amoghapāśa, the great maṇḍala of the lotus-holding lord from the lotus family, will be able to accomplish whatever task he thinks of, and will amogha-enter all samayas.

source: །ཆོས་ཉིད་ཐམས་ཅད་ཀྱིས་རྣམ་པར་གྲོལ་བའི་དཀྱིལ་འཁོར་གྱི་ཆོས་ལ་དམ་ཚིག་གྲུབ་པར་འགྱུར་རོ།
en: This maṇḍala of liberation is the totality of phenomena; it establishes the samaya with the true nature of phenomena. “

source: །ལས་ཀྱི་སྒྲིབ་པ་ཐམས་ཅད་ལས་རྣམ་པར་གྲོལ་བ་དང་། བདེ་བ་ཐམས་ཅད་ཀྱི་རྗེས་སུ་འགྲོ་ཞིང་ལྷ་དང་མིའི་དཔལ་ཐམས་ཅད་མྱོང་བར་འགྱུར་རོ། །ལྷ་དང་།
en: He will be free from all karmic obscurations, will be destined to obtain every happiness, and will experience both divine and human splendor.

source: ལྷ་མ་ཡིན་དང་། གནོད་སྦྱིན་དང་། སྲིན་པོའི་ཚོགས་ཀྱི་བགོ་སྐལ་ལ་དབང་བར་འགྱུར་རོ། །རྣལ་འབྱོར་གྱི་དཀྱིལ་འཁོར་དང་གསང་སྔགས་ལ་བརྟེན་པར་འགྱུར་རོ།
en: The hosts of devas, asuras, yakṣas, and rākṣasas will become his followers and send him provisions such as clothing and food.

source: །བརྡེག་པ་དང་། སྤྱོ་བ་དང་ཕུར་བུས་གདབ་པ་དང་། བསྲེག་པ་དང་བསྡིགས་པ་དང་གཡེང་བ་དང་། གསད་པ་དང་། དབང་དུ་བྱ་བས་མི་ཚུགས་སོ།
en: He will never be beaten, abused, impaled, burned, threatened, thrown, killed, or subdued.

source: །གང་དག་དེ་ལྟ་བུ་བྱེད་པ་དེ་ཉིད་ཀྱི་ལུས་སམ། མགོ་ལ་བརྒྱ་ཕྲག་སྟོང་གྱུར་དུ་འབབ་པར་འགྱུར་ཞིང་། གཞན་གྱིས་ཕྱིར་བཟླས་ཤིང་དགྲོལ་བར་མི་ནུས་ཏེ། རིག་སྔགས་འཆང་དེས་དགྲོལ་བར་བྱའོ།
en: Those who try to do any of these things will have their heads and bodies dashed into one hundred thousand pieces, and no one other than the vidyā holder can save them, neither Pratyaṅgirā nor any other śakti goddess. “

source: །དེ་ནས་རིག་སྔགས་འཆང་དེས་རི་མོའི་གཟུགས་དེ་དཀྱིལ་འཁོར་ལ་མངོན་དུ་ཕྱོགས་པར་བཞག་ནས། དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་སྟོང་རྩ་བརྒྱད་བཟླས་ལ། དོན་ཡོད་པའི་ཞགས་པའི་ཕྱག་རྒྱ་ལན་བརྒྱ་རྩ་བརྒྱད་བཅིང་བར་བྱ་ཞིང་།
en: The vidyā holder should position the painting to face the maṇḍala and recite the heart mantra of Amoghapāśa one thousand and eight times while displaying the mudrā of Amoghapāśa one hundred and eight times.

source: ཁྲོ་བོའི་རྒྱལ་པོ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་པར་བྱའོ། །དེའི་འོག་ཏུ་དཀྱིལ་འཁོར་གྱི་ལྷ་རྣམས་ལས་འོད་ཟེར་ཁ་དོག་སྣ་ཚོགས་འབྱུང་བར་འགྱུར་རོ། །བུམ་པ་དེ་ཡང་འབར་ལ། རས་ཀྱི་སྐུ་གཟུགས་དེ་ཡང་ཁ་དོག་སྣ་བདུན་དུ་འབར་ཞིང་། ཤས་ཆེར་འགུལ་བར་འགྱུར་ཏེ།
en: He should also recite the Krodharāja mantra twenty-one times, after which the images of the deities in the maṇḍala will emit light of various colors, the jar will blaze with light, and the cloth painting, too, will blaze with rich colors.

source: ཁྲོ་བོའི་རིག་སྔགས་འཆང་སྙིང་དགའ་བར་འགྱུར་ཞིང་།
en: The painting will then shake violently, at which time the vidyā holder should grab hold of it.

source: རས་ཀྱི་སྐུ་གཟུགས་ལས་ལེགས་སོ་ཞེས་བྱ་བའི་སྒྲ་འབྱུང་བར་འགྱུར་ཏེ།
en: The following words will then resound from the painting: ‘Good!

source: །ཁྱོད་ཀྱིས་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་གྲུབ་ཅིང་། ཁྱོད་ཀྱིས་ཞགས་པ་འདི་ཡང་གྲུབ།
en: You have accomplished the essence of Noble Avalokiteśvara-Amoghapāśa, and you have accomplished his noose.

source: ཁྱོད་ཀྱིས་ཡིད་བཞིན་གྱི་ནོར་བུའི་ཞགས་པའི་མཆོག་འདི་ཡང་གྲུབ་ཀྱིས།
en: This is the supreme accomplishment of the noose that is like a wish-fulfilling jewel.

source: ཁྱོད་ཀྱིས་ལས་ཐམས་ཅད་བྱོས་ཤིག །
en: You can now perform all activities.

source: དེ་དཀྱིལ་འཁོར་གྱི་ཆོ་ག་རྒྱས་པ་མཆོག་གྲུབ་ནས།
en: You have won the supreme accomplishment of the extended maṇḍala-procedure.’ “

source: བུམ་པ་སྤོས་ཆུས་བཀང་བདེ་བླངས་ལ་ལན་བརྒྱ་རྩ་བརྒྱད་བཟླས་ཏེ། རྒྱུ་སྐར་རྒྱལ་ལ་ཁྲུས་བྱ་བའམ་ཟླ་བ་ཡར་གྱི་ངོའི་ཚེས་གྲངས་ཤིས་པ་ལ་ཁྲུས་བྱས་པ་ཙམ་གྱི་མོད་ལ།
en: The vidyā holder can take the jar full of scented water, incant it one hundred and eight times, and bathe in it on an auspicious day of the bright fortnight during the asterism of Puṣya.

source: ལུས་ཐམས་ཅད་དྲི་མ་མེད་ཅིང་ཡོངས་སུ་དག་པ་འཐོབ་པར་འགྱུར་ཞིང་། དངོས་པོ་ལྔའི་བདག་ཉིད་ཡོངས་སུ་དག་པར་འགྱུར་ཏེ། རྣ་བ་ལྔ་ཡོངས་སུ་དག་པ་དང་།
en: The moment he does, he will be free of all physical impurities and become completely pure, purifying his fivefold bodily existence.

source: མིག་ལྔ་ཡོངས་སུ་དག་པ་དང་། སྣ་ལྔ་ཡོངས་སུ་དག་པ་དང་། ལྕེ་ལྔ་ཡོངས་སུ་དག་པ་དང་། རྣམ་པར་ཤེས་པ་ལྔ་ཡོངས་སུ་དག་པ་དང་། དབང་པོ་ལྔ་ཡོངས་སུ་དག་པ་ཐོབ་པར་འགྱུར་རོ།
en: His five sense faculties, including the five types of hearing, the five types of seeing, the five types of smelling, the five types of tasting, and the five types of consciousness, will be completely purified.

source: །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་རྟག་ཏུ་མཆོག་སྦྱིན་པར་འགྱུར་ཞིང་། རྟག་ཏུ་སྐུ་སྟོན་བཞེད་པར་ཡང་འགྱུར་རོ།
en: Noble Avalokiteśvara will always grant him boons and will always be willing to appear to him.

source: །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཞལ་སྟོན་པར་འགྱུར་རོ། །རྟག་ཏུ་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་དགོངས་པར་འགྱུར་རོ།
en: He will be able to clearly perceive all the tathāgatas, and he will always receive the bodhisattvas’ attention. “

source: །ལྷ་ཐམས་ཅད་ཀྱང་དེ་ལ་སྲུང་བ་དང་སྐྱོབ་པ་དང་སྦ་བ་བྱེད་པར་འགྱུར་རོ། །བརྒྱ་བྱིན་དང་ཚངས་པ་ལ་སོགས་པ་དག་ཀྱང་འོང་བར་འགྱུར་རོ།
en: All deities will stand by to guard, protect, and defend the vidyā holder, and gods such as Śakra and Brahmā will always attend upon him.

source: །རྒྱལ་པོ་ཆེན་པོ་བཞི་དཔུང་གི་འཁོར་དང་བཅས་ཏེ་སའི་ཕྱོགས་དེར་འོང་བར་འགྱུར་ཞིང་། རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་སྲུང་བ་དང་སྐྱོབ་པ་དང་སྦ་བ་བྱེད་པར་འགྱུར་རོ། །སྲེད་མེད་ཀྱི་བུ་དང་།
en: The Four Great Kings with their armies and retinues will assemble wherever he is, in order to guard, protect, and defend him at all times.

source: དབང་ཕྱུག་ཆེན་པོ་དང་། ནོར་བུ་བཟང་པོ་དང་། གསང་བ་པ་བརྒྱ་སྟོང་ཕྲག་དུ་མ་སྲུང་བ་དང་སྐྱོབ་པ་དང་སྦ་བ་བྱེད་པར་འགྱུར་ཞིང་། ཞི་བ་དང་བདེ་ལེགས་སུ་བྱེད་པར་འགྱུར་རོ།
en: Nārāyaṇa, Maheśvara, and Maṇibhadra, together with many hundreds of thousands of guhyakas, will guard, defend, and protect him and will ensure his peace and well-being.

source: །ཤེས་པ་དོན་ཡོད་པ་དང་། ཤེས་རབ་དོན་ཡོད་པ་དང་། ཐོས་པ དང་། ཚུལ་ཁྲིམས་དང་། བརྩོན་འགྲུས་འཐོབ་པར་འགྱུར་ཞིང་།
en: The vidyā holder will also obtain amogha knowledge and amogha insight, as well as amogha learning, discipline, and courage.

source: སྦྱིན་པ་དོན་ཡོད་པའི་སྦྱིན་པར་འགྱུར་རོ། །བསོད་ནམས་ཀྱི་ཕུང་པོ་དོན་ཡོད་པ་དང་ལྡན་པར་འགྱུར་ཞིང་འདི་ལྟ་སྟེ་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: He will develop amogha generosity and accumulate amogha merit. That is to say, he will fully realize the six perfections. “

source: །རྫུ་འཕྲུལ་དཔག་ཏུ་མེད་པ་ལ་མཁས་པར་ཡང་འགྱུར་རོ། །རིག་སྔགས་འཆང་གི་ཆོ་ག་ཞིབ་མོ་ཡང་འགྲུབ་པར་འགྱུར་རོ།
en: The vidyā holder will also develop infinite powers and skills, including magical powers and knowledge.

source: །སྟོབས་དང་བརྩོན་འགྲུས་དང་ཕ་རོལ་གནོན་པ་དོན་ཡོད་པར་འགྱུར་རོ། སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་ཕུན་སུམ་ཚོགས་པ་ཐོབ་པར་འགྱུར་རོ།
en: He will possess amogha strength, heroism, and enterprise, and he will obtain the wonderful array of qualities of the buddha fields.

source: །དེ་བཞིན་གཤེགས་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ས་ཡ་བརྒྱ་ཕྲག་བརྒྱད་སྟོང་དྲུག་ཅུ་རྩ་བཞིའི་དགེ་བའི་རྩ་བ་ཡོངས་སུ་རྫོགས་པར་ཡང་དག་པར་གཟུང་བར་འགྱུར་རོ།
en: He will accumulate and bring to perfect fruition the roots of virtue equal to those of the tathāgatas as numerous as the hundreds of thousands of millions grains of sand in the Gaṅgā river.

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱིས་ཀྱང་མཆོད་པ་དང་བཀུར་སྟི་བྱ་བར་འགྱུར་ཞིང་ཐམས་ཅད་དབང་དུ་འགྱུར་རོ།
en: He will be honored and celebrated by all beings, and they will all fall under his thrall.

source: །མཆོད་རྟེན་གྱི་སྙིང་པོ་དང་འདྲ་བར་ཕྱག་བྱ་བའི་འོས་སུ་འགྱུར་རོ།
en: He will be revered to the same degree as sacred relics. “

source: །དཀྱིལ་འཁོར་གྱི་ཆོ་ག་ཞིབ་མོའོ།། །།འཕགས་པ་དོན་ཡོད་པའི་ཞགས་པའི་ཆོ་ག་ཞིབ་མོའི་རྒྱལ་པོ། བམ་པོ་དགུ་པ།
en: This was the maṇḍala procedure.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་སྟན་ལས་ལངས་ནས། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས། པུས་མོ་གཡས་པའི་ལྷ་ངས་ལ་བཙུགས་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་ཏེ་བཏུད་ནས། བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ཏེ།
en: Then the bodhisattva great being Noble Avalokiteśvara got up from his seat, draped his robe over his left shoulder, knelt on his right knee, approached the Blessed One, and circled him clockwise three times.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་བྱས་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ལ་པདྨའི་རིགས་ལ་རྣམ་པར་གྲོལ་བའི་དཀྱིལ་འཁོར་གྱི་ཆོ་ག་རིག་སྔགས་ཆེན་པོའི་རིམ་པར་ཕྱེ་བ་ཆོ་ག་ཞིབ་མོ་དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ། རིག་སྔགས་ཀྱི་རྒྱལ་པོ་ཆེན་པོ་མཆིས་ཏེ།
en: He then bowed his head to the feet of the Blessed One and said, “Lord, in this great manual of mine that belongs to the lotus family and constitutes a maṇḍala of liberation, there is a great king of vidyās that is the heart essence of Amoghapāśa.

source: བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་དེ་བདག་གིས་ཡོངས་སུ་བསྒྲག་པར་བགྱིའོ།
en: I will now, lord, make it known to this assembly, in front of you.”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་བཞིན་འཛུམ་པས། བཅོམ་ལྡན་འདས་ལ་ལྟ་བཞིན་དུ་དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་འདི་སྨྲས་སོ། །ན་མ་སྟྲཻ་ཡད་དྷྭཱ་ནུ་ག་ཏ་པྲ་ཏིཥྛི་ཏི་བྷྱཿ སརྦ་བུད་དྷ་བོ་དྷི་ས་ཏྭེ་བྷྱཿ ན་མཿཔྲ་ཏྱེ་ཀ་བུདྡྷཱརྱ་ཤྲཱ་བ་ཀ་སཾ་གྷེ་བྷྱཿ ཨ་ཏཱི་ཏཱ་ནུ་ག་ཏཱ་པྲ་ཏྱུད་པནྣེ་བྷྱཿ ནམཿསམྱཀ་ག་ཏཱ་ནཱཾ།
en: Looking up at the Blessed One and smiling, Noble Avalokiteśvara pronounced the following heart mantra of Amoghapāśa: “Homage to all the buddhas and bodhisattvas of the three times!

source: ན་མཿས་མྱ་ཀ་པྲ་ཏི་པནྣཱ་ནཱཾ།
en: Homage to all the pratyekabuddhas and all the congregations of noble śrāvakas of the past, present, and future!

source: ན་མཿཤཱ་ར་དྭ་ཏི་སཱུ་ཏཱ་ཡ།
en: Homage to those who follow the right conduct and to those who have entered the right path!

source: མ་ཧཱ་མ་ཏ་ཡེ། ན་མཿཨཱརྱ་མཻཏྲེ་ཡ་པྲ་མུ་ཁེ་བྷྱོ།
en: Homage to the great being, Śāradvatīsuta!

source: མ་ཧཱ་བོ་དྷི་སཏྭ།
en: Homage to the supreme congregations of great bodhisattvas headed by Noble Maitreya!

source: ཨཱརྱ་ག་ཎ་བ་རེ་བྷྱཿན་མ་ཨཱརྱ་ཨ་མི་ཏཱ་བྷཱ་ཡ།
en: Homage to the noble Tathāgata Amitābha, the worthy, fully realized Buddha.

source: ཏ་ཐཱ་ག་ཏཱ་ཡ། ཨརྷ་ཏེ་ས་མྱ་ཀ་སམ་བུད་དྷཱ་ཡ། ན་མོ་རཏྣ་ཏྲ་ཡཱ་ཡ། ན་མ་ཨཱརྱཱ་བ་ལོ་ཀི་ཏེ་ཤྭ་རཱ་ཡ། བྷོ་དྷི་ས་ཏྭཱ་ཡ།
en: Homage to the Three Jewels!

source: མ་ཧཱ་ས་ཏྭཱ་ཡ། མ་ཧཱ་ཀཱ་རུ་ཎི་ཀཱ་ཡ། ཏེ་བྷྱོ་མ་ཧཱ་རྀ་ཥི་ཨཱརྱ་ག་ཎ་བ་རེ་བྷྱོ་ན་མ་སྐྲྀ་ཏྭཱ་ཨི་དཾ་ཨཱརྱཱ་བ་ལོ་ཀི་ཏེ་ཤྭ་ར་མུ་ཁོང་གཱིརྞྞཾ་ཨ་མོ་གྷ་རཱ་ཛ་ན་ནཱ་མ་ཧྲྀ་ད་ཡན།
en: Homage to the bodhisattva great being Noble Avalokiteśvara, who has great compassion!

source: ཏ་ཐཱ་ག་ཏཱ་སཾ་མུ་ཁཾ་བྷཱ་ཤི་ཏཾ་མ་ཧཱ་ཏཾ་པར་ཥཾ་མ་དྷྱེ་ཨ་ཧ་མི་དཱ་ནཱི་མཱ་བརྟྟ་ཡིཥྱཱ་མི། སི་དྷྱཾ་ཏུ་མེ་མནྟྲ་པ་དཱཿསརྦ་ཀཱ་རྱཱ་ཎི།
en: Having saluted you, the supreme and noble congregations of great sages, I will now pass on to you, in the midst of this great assembly, this heart mantra, referred to as Amogharāja, that emerges from the mouth of Noble Avalokiteśvara and is spoken in front of the tathāgatas.

source: སརྦ་བྷ་ཡེ་བྷྱོ་མ་མ་སརྦ་སཏྭཱ་ནཱཉྩ་རཀྵ་བྷ་བ་ཏུ། ཏདྱ་ཐཱ། ཨོཾ་ཙ་ར་ཙ་ར།
en: May Śrī, the goddess of the three worlds, grant me success in all my endeavors!

source: ཙི་རི་ཙི་རི།
en: May I and all beings be protected from all dangers!

source: ཙུ་རུ་ཙུ་རུ། མ་ཧཱ་ཀཱ་རུ་ཎི་ཀ །བི་རི་བི་རི།
en: The mantra to recite is: [167] “Oṁ, cara cara, ciri ciri, curu curu, O greatly compassionate!

source: པི་རི་པི་རི། ཙི་རི་ཙི་རི། པ་ར་མ་མ་ཧཱ་ཀཱ་རུ་ཎི་ཀ །
en: Viri viri, piri piri, ciri ciri, O supremely compassionate!

source: སི་རི་སི་རི། པི་རི་པི་རི། ཙི་རི་ཙི་རི། མ་ཧཱ་པདྨ་ཧ་སྟེ།
en: Siri siri, piri piri, ciri ciri, O great one with the lotus in your hand!

source: ཀ་ལ་ཀ་ལ། ལི་ཀི་ལི་ཀི། ཀུ་ལུ་ཀུ་ལུ། མ་ཧཱ་ཤུད་དྷ་ས་ཏྭ།
en: Kala kala, kili kili, kulu kulu, O great pure being!

source: ཨེ་ཧྱེ་ཧི།
en: Come, come!

source: བུ་དྷེ་བུ་དྷེ།
en: Awaken, awaken!

source: ཀི་ཎི་ཀི་ཎི། ཀུ་ཎུ་ཀུ་ཎུ། པ་ར་མ་ཤུད་དྷ་སཏྭ། ཀ་ར་ཀ་ར།
en: Kaṇa kaṇa, kiṇi kiṇi, kuṇu kuṇu, O supremely pure being!

source: ཀི་རི་ཀི་རི། ཀུ་རུ་ཀུ་རུ། མ་ཧཱ་སྠཱ་མ་པྲཱ་བྷ། ཙ་ལ་ཙ་ལ། སཉྩ་ལ་སཉྩ་ལ།
en: Kara kara, kiri kiri, kuru kuru, you of great tenacity!

source: བི་ཙ་ལ་བི་ཙ་ལ། ཨེ་ཊ་ཊ་ཨེ་ཊ་ཊ། བྷ་ར་བྷ་ར། བྷི་རི་བྷི་རི། བྷུ་རུ་བྷུ་རུ།
en: Cala cala, sañcala sañcala, vicalavicala, eṭaṭa eṭaṭa, bhara bhara, bhiri bhiri, bhuru bhuru, come, come, O greatly compassionate!

source: ཨེ་ཧྱེ་ཧི། མ་ཧཱ་ཀཱ་རུ་ཎི་ཀ །མ་ཧཱ་པ་ཤུ་པ་ཏི། བེ་ཥ་དྷ་ར། དྷ་ར་དྷ་ར།
en: You wear the garb of the great Paśupati, wear, wear, sara sara, cara cara, hara hara!

source: ས་ར་ས་ར། ཙ་ར་ཙ་ར། ཧ་ར་ཧ་ར། ཧ་ཧཱ་ཧ་ཧཱ།
en: Hā hā hā hā!

source: ཧི་ཧཱི་ཧི་ཧཱི། ཧུ་ཧཱུ་ཧུ་ཧཱུ། ཨོཾ་ཀཱ་ར་མ་ཧཱ་བྲཧྨ། བེ་ཥ་དྷ་ར།
en: Hī hī hī hī!

source: དྷ་ར་དྷ་ར། དྷི་རི་དྷི་རི། དྷུ་རུ་དྷུ་རུ། ཏ་ར་ཏ་ར།
en: Hū hū hū hū!

source: ས་ར་ས་ར། པ་ར་པ་ར། ཙ་ར་ཙ་ར། བ་ར་བ་ར། བ་ར་ད།
en: You wear the garb of Oṁkāra Brahmā, wear, wear, dhiri dhiri, dhuru dhuru, tara tara, sara sara, para para, cara cara, vara vara!

source: རཤྨི་ཤ་ཏ་ས་ཧ་སྲེ་པྲ་ཏི་མཎྜི་ཏ་ཤ་རཱི་ར།
en: Your body is adorned with hundreds of thousands of beautiful rays of light!

source: ཛྭ་ལ་ཛྭ་ལ། ཏ་པ་ཏ་པ་བྷ་ག་བཱ་ན། སཽ་མ་ཨཱ་དི་ཏྱ། ཡ་མ། པ་རུ་ཎ། ཀུ་བེ་རེ། བྲཧྨེན་དྲ། རྀ་ཥི་ག་ཎ། ཨ་བྷྱ་རྩི་ཏ་ཙ་ར་ཎ། སུ་རུ་སུ་རུ། ཙུ་རུ་ཙུ་རུ། པུ་རུ་པུ་རུ། མུ་རུ་མུ་རུ།
en: Blaze, blaze, heat up, heat up!

source: ས་ནད་ཀུ་མཱ་ར། རུ་དྲ། བཱ་ས་བ། བིཥྞུ་དྷ་ན་ད། དེ་བ་རྀ་ཥི་ནཱ་ཡ་ཀ་བ་ཧུ་བི་བིདྷ་བེ་ཥ་དྷ་ར།
en: O lord whose feet are worshiped by Soma, Āditya, Yama, Varuṇa, Kubera, Brahmā, Indra, and the hosts of ṛṣis and gods,suru suru, curu curu, puru puru, muru muru!

source: ཐ་ར་ཐ་ར། གྷ་ར་གྷ་ར། ཡ་ར་ཡ་ར། ལ་ར་ལ་ར། ཧ་ར་ཧ་ར། མ་ར་མ་ར། པ་ར་པ་ར། བ་ར་བ་ར། བ་ར་དཱ་ཡ། ཀ་ས་མན་ཏ། ཨ་བ་ལོ་ཀི་ཏ། ལོ་ཀེ་ཤྭ་ར་མ་ཧེ་ཤྭ་ར། མུ་ཧུ་མུ་ཧུ། མུ་རུ་མུ་རུ།
en: You wear many garbs, wear, wear, dhiri dhiri, dhuru dhuru, thara thara, ghara ghara, yara yara, lara lara, hara hara, mara mara, vara vara!

source: མུ་ཡ་མུ་ཡ། མུཉྩ་མུཉྩ། བྷ་ག་བཱ་ན། ཨཱརྱཱ་བ་ལོ་ཀི་ཏེ་ཤྭ་ར། རཀྵ་རཀྵ།
en: You, the great boon-granting lokeśvara lord with panoptic vision, muhu muhu, muru muru, muya muya, liberate, liberate!

source: མཱཾ་སརྦྦ་སཏྭཱཾཤྩ་སརྦྦ་བ་ཡེ་བྷྱཿ སརྦྦོ་བ་སརྒེ་བྷྱཿ སརྦྦ་གྲ་ཧེ་བྷྱཿ སརྦྦ་བྱཱ་དྷི་བྷྱཿ སརྦྦ་ཛྭ་རེ་བྷྱཿ ཨེ་ཝཾ། བདྷ། བཾ་དྷ་ན། ཏཱ་ཌ་ན། ཏ་རྫ་ན།
en: Noble Lord Avalokiteśvara, protect me, protect me and all beings from all dangers, misfortunes, and disasters, and from all the grahas and diseases!

source: རཱ་ཛ་ཙཽ་ར་ཏ་སྐ་ར། ཨག་ནི། ཨུད་ཀ །བི་ཥ། ཤུསྟྲ། པ་རི་མོ་ཙ་ཀ །
en: You deliver from all killings, imprisonment, abuses by the kings, thieves, bandits, fires, floods, poisons, and weapons!

source: ཀ་ཎ་ཀ་ཎ། ཀི་ཎི་ཀི་ཎི། ཀུ་ཎུ་ཀུ་ཎུ། ཙ་ར་ཙ་ར། ཨིན་དྲི་ཡ། བ་ལ་བོ་དྷྱཾ་ག །
en: Kaṇa kaṇa, kiṇi kiṇi, kuṇu kuṇu, cara cara!

source: ཙ་ཏུ་རཱ་རྱ་སཏྱ་སམ་པྲ་ཀཱ་ཤ་ཀ །
en: You teach about the sense faculties, the strengths, the limbs of awakening, and the four truths of the noble ones!
